#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "rus");

	/*Напишите программы, решающие задачи, представленные в общих заданиях. 
	Для решения задач необходимо использовать указатели.

	Для работы с массивами не использовать индексы, необходимо использовать 
	адресную арифметику. Все результаты работы программ необходимо выводить на экран.

		Общие задания

	1) Объявите целочисленную переменную a. Создайте указатель, хранящий 
	адрес переменной а. Считайте значение переменной а с клавиатуры. 
	Выведете ее значение через указатель.

	2) Объявите целочисленные переменные a и b. Создайте указатели pa и pb, 
	хранящие адрес этих переменных соответственно. Считайте значение этих переменных 
	с клавиатуры. Произведите вычисления суммы и разности этих переменных через указатели 
	(получите их значения из указателей) и сохраните результаты в переменные sum и razn. 
	Сделайте так, чтобы указатели pa и pb теперь ссылались на sum и razn. 
	Выведите результаты через указатели.

	3) Напишите функцию f, которая принимает вещественное значение по адресу (через указатель).
	Увеличьте принятую переменную на 10. Функция не должна возвращать значения. 
	В main() создайте вещественную переменную t считайте ее значение с клавиатуры и 
	вызовите функцию f с переменной t в качестве аргумента. После этого выведите t на экран.

	4) Создайте целочисленный массив m. Создайте константу N, которая будет отвечать 
	за количество элементов в массиве. Создайте функцию, которая принимает массив m и 
	заполняет его случайными числами от 0 до 100. После обработки массива 
	функцией выведите массив на экран в функции main().*/




}